{
  "title": "Baked Spaghetti",
  "author": "Beth- Budget Bytes",
  "type": "sweets",
  "health index": 5,
  "website": "https://www.budgetbytes.com/baked-spaghetti-with-sausage/",
  "ingredients": [
    "yellow onion",
    "cloves garlic",
    "olive oil",
    "italian sausage",
	"tomato paste",
	"can crushed tomatoes",
	"italian seasoning",
	"salt",
	"water",
	"spaghetti",
	"cottage cheese",
	"grated parmesan",
	"black pepper",
	"shredded mozzarella",
	"parsley"
  ],
  "measurements": [
    "1 yellow onion",
    "3 cloves garlic",
    "1 tbsp olive oil",
    "1//2 lb italian sausage",
	"3oz tomato sauce",
	"1 28oz can crushed tomatoes",
	"1//2 tsp italian seasoning",
	"1//2 tsp salt",
	"1//2 cup water",
	"12oz spaghetti",
	"1 cup small curd cottage cheese",
	"1//4 cup grated parmesan",
	"1//4 tsp freshly cracked blac pepper",
	"1 cup shredded mozzarella",
	"1 tbsp chopped parsely (optional granish)"
  ],
	"instructions": "1. Dice the onion and mince the garlic\n2. Add the olive oil to a large skillet and heat over medium. Add the italian sauce and cook until browned\n 3.Add the chopped onion and minced garlic to the skillet and continue to stir and cook until the onions are soft and translucent.\n4.Add the tomato paste, crushed tomatoes, Italian seasoning, salt, and water. Stir to combine, then allow the sauce to come up to a simmer. Reduce the heat to medium-low and let the sauce simmer while you cook the pasta.\n 5.Preheat the oven to 350 degrees. Add ½ Tbsp salt to a large pot of water and bring it to a boil over high heat. Add the spaghetti and continue to boil until the pasta is tender, but not fully cooked. Drain the pasta in a colander.\n6.Add the drained pasta to the sauce and stir to combine.\n7. Combine the cottage cheese, Parmesan, and pepper in a bowl.\n8. Lightly grease an 8×11 casserole dish. Layer in half of the spaghetti and sauce, then top with the cottage cheese mixture. Add the second half of the spaghetti and sauce, then top with the shredded mozzarella.\n9. Cover the dish with foil then bake the spaghetti for 30 minutes. Top the spaghetti with chopped parsley, if desired. Slice into six pieces, then serve!"
}
